---
kind: property
id: P:Autodesk.Revit.UI.ColorSelectionDialog.IsValidObject
source: html/0408a471-94fb-3687-b624-e2a3499d4baa.htm
---
# Autodesk.Revit.UI.ColorSelectionDialog.IsValidObject Property

Specifies whether the .NET object represents a valid Revit entity.

## Syntax (C#)
```csharp
public bool IsValidObject { get; }
```

## Returns
True if the API object holds a valid Revit native object, false otherwise.

## Remarks
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
 a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.